#@ # 
#@ # Running lm_shell Version V-2023.12 for linux64 -- Nov 23, 2023
#@ # Date:   Sat Mar 30 11:05:59 2024
#@ # Run by: vlsi@elc-p07-2088-05-lnx
#@ 

start_gui
gui_set_pref_value -category {SelectByNamePalette} -key {ObjectType} -value {Logical Cells}
create_workspace -flow exploration -technology /home/vlsi/Desktop/DONOT_DELETE_IT/Standardcell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/process/astro/tech/astroTechFile.tf NDM_TEST
change_selection [get_workspaces {NDM_TEST}]
set_app_options -list {lib.workspace.keep_all_physical_cells {true}}
set_app_options -list {lib.workspace.save_design_views {true}}
set_app_options -list {design.enable_lib_cell_editing {mutable}}
read_db { /home/vlsi/Desktop/DONOT_DELETE_IT/Standardcell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/synopsys/models/saed90nm_max_lth.db }
change_selection [get_workspaces {NDM_TEST}]
read_lef /home/vlsi/Desktop/DONOT_DELETE_IT/Standardcell/SAED90nm_EDK_10072017/SAED_EDK90nm/Digital_Standard_cell_Library/lef/saed90nmEditted.lef
change_selection [get_workspaces {NDM_TEST}]
group_libs
change_selection [get_workspaces {NDM_TEST}]
process_workspaces  -directory /home/vlsi/Desktop/DONOT_DELETE_IT/ndm
change_selection [get_workspaces {NDM_TEST}]
